Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Сценарий — последовательность действий, которые необходимо провести для анализа данных.
en: Workflow: sequence of actions that must be performed for data analysis.

source: Сценарий — содержит последовательность узлов обработки данных.
en: The Workflow contains sequence of data processing nodes.

source: Сценарий — содержит последовательность узлов обработки данных;
en: The Workflow contains sequence of data processing nodes.

source: Таблица в переменные
en: Table to variables

source: Таблица в переменные Таблица в переменные
en: Table to Variables Table to Variables

source: Таблица в переменные — преобразует таблицу данных в набор переменных.
en: Table to variables enables to transform a data table to a set of variables.

source: Таблица замен N — наименование принимающего таблицу порта.
en: Replacement table N: the name of the table accepting port.

source: Таблица замен (Таблица замен N) — используется внешняя таблица замен.
en: Replacement table (Replacement table N): the external replacement table is used.

source: Таблица замен;
en: Replacement table.

source: Таблица/Представление — извлечение заданных полей объекта БД.
en: Table/View enables to retrieve set fields of the DB object.

source: Таблица Таблица — данные будут представлены визуализатором Таблица, но без возможности фильтрации и без панели детализации;
en: Table Table: the data will be displayed by the Table visualizer but without filtering option and detailing panel;

source: Таблица Таблица;
en: Table Table;

source: Таблица — сопоставление осуществляется путем выбора входных полей/переменных в таблице.
en: Table: mapping is performed by selecting the input fields/variables in the table.

source: Тайм-аут выполнения узла (мсек.) — устанавливает время выполнения узла:
en: Node execution timeout (ms) enables to set the time of the node execution:

source: Таймаут обмена данными (мсек) — максимальное время ожидания данных от сервера в миллисекундах, по истечении которого при отсутствии отклика обращение будет прервано со статусом ошибки.
en: Data exchange timeout (ms): the maximum timeout of data wait from server expressed in milliseconds upon expiration of which the access will be terminated with an error status providing that there is no response.

source: Таймаут обмена данными (мсек) — максимальное время, которое будет затрачено на отправку HTTP-запроса и получение ответа, по истечении которого обмен будет прерван со статусом ошибки.
en: Data exchange timeout (ms): the maximum time that is required to send HTTP request and receive response upon expiration of which the exchange will be terminated with an error status.

source: Таймаут подключения (мсек) — максимальное время ожидания ответа от сервера в миллисекундах, по истечении которого при отсутствии отклика обращение будет прервано со статусом ошибки.
en: Connection timeout (ms): the maximum timeout of server response wait expressed in milliseconds upon expiration of which the access will be terminated with an error status providing that there is no response.

source: Таймаут подключения (мсек) — максимальное время установки TCP-соединения с сервером в миллисекундах, по истечении которого соединение будет прервано со статусом ошибки.
en: Connection timeout (ms): the maximum time required for TCP server connection expressed in milliseconds upon expiration of which the connection will be terminated with an error status.

source: Текст запроса – поле ввода запроса к базе, определяющего структуру и содержание импортируемой таблицы.
en: Request text: the field for request to base entry. It determines structure and content of the imported table.

source: Текстовый файл
en: Text file

source: Текущий модуль — содержит перечень узлов модуля, в котором в данный момент создается узел Выполнение узла;
en: Current module contains a list of nodes of the module in which Node execution node is currently created.

source: Текущий пакет (наименование пакета) — содержит перечень узлов текущего пакета.
en: Current package (the package name) contains a list of nodes of the current package.

source: Термины
en: Terms

source: Тестовое — подмножество обучающей выборки, содержащее тестовые примеры, т.е. примеры, использующиеся не для обучения модели, а для проверки его результатов.
en: Test: the training sample subset that contains test examples, namely, the examples used not to train the model but to check its results.

source: Тип авторизации — представляет выпадающий список с вариантами авторизации.
en: Authorization Type provides a drop-down list with authorization options.

source: Тип авторизации — представляет выпадающий список с вариантами авторизации:
en: Authorization Type provides a drop-down list with authorization options:

source: Тип данных переменной.
en: The Variable data type.

source: Тип данных — тип данных , в который будет преобразовано текстовое значение поля.
en: Data type — data type: the text field value will be transformed.

source: Тип данных — выбирается тип данных поля в выходном наборе данных;
en: Data type: it is required to select data type of the field in the output data set.

source: Тип данных — один из возможных типов данных.
en: Data type: one of the possible data types.

source: Тип данных — тип данных вычисляемого выражения;
en: Data type: the data type of the calculated expression.

source: Тип децимации.
en: Decimation type.

source: Тип значения — содержит пояснения к каждому коду типа значения, где.
en: Value type contains clarifications concerning each value type code, etc.

source: Тип меток и Тип подсказок.
en: Type of captions and Type of tooltips.

source: Тип накопления.
en: Stacking type.

source: Тип операции — выбор способа слияния;
en: Operation type enables to select the join method.

source: Тип создания производных столбцов — кнопка отображается в случае, когда алгоритм компонента предусматривает добавление в результирующий набор новых полей/переменных, вычисленных на основе исходных (например, компонент Замена), варианты настройки следующие:
en: Type of derived columns creation. The button is displayed only when the component algorithm provides for addition to the resulting data set of the new fields/variables calculated on the basis of the source ones (for example, Replace component). There are the following configuration options:

source: Тип файла Excel
en: Excel file type

source: Тип экспорта — задается выбором одного из вариантов.
en: Export type enables to select one of the options.

source: Тип — тип данных переменной в выходном наборе данных;
en: Type — data type of the variable in the output data set.

source: Тип — вид данных поля.
en: Type: kind of the field data.

source: Тип — задается тип диаграммы;
en: Type: the chart type is set.

source: Тип — отображает типа элемента.
en: Type enables to display the item type.

source: Тип — тип границы;
en: Type — bound type;

source: Тип — тоже что и Тип в Доступных элементах;
en: Type is the same as the Type in the Available items.

source: Типы данных
en: Data types

source: Типы данных Типы данных — переключить отображение иконки типов данных.
en: Data types Data types: switch data type icon representation.

source: Типы данных — столбец, содержащий информацию о типе данных значений.
en: Data types: the column that contains information on the data type of values.

source: Токен OAuth — выбирается при подключении к SOAP-сервису посредством протокола OAuth.
en: OAuth token is selected when connecting to SOAP service via OAuth protocol.

source: Токен OAuth — выбирается при подключении к веб-сервису посредством протокола OAuth версии 2.0.
en: OAuth token is selected when connecting to the web service via OAuth 2.0 protocol.

source: Токен OAuth — поле становится активным если выбран тип Токен OAuth.
en: OAuth token: the field becomes active if OAuth token type is selected.

source: Токен OAuth — поле становится активным, если выбран тип Токен OAuth.
en: OAuth token: the field becomes active if OAuth token type is selected.

source: Точек отсутствия для прекращения позиции — если позиция отсутствует в ряду указанное число точек, то она исключается из прогноза.
en: Absent data points for position termination: if any position is absent in the series for the specified number of points, it will be excluded from the forecast.

source: Точек — количество отображаемых точек.
en: Points: the number of displayed points.

source: Точное совпадение
en: Exact match

source: Точному совпадению;
en: Exact match.

source: Точность решения — критерий остановки итераций.
en: Solution accuracy: criterion of iterations stop.

source: Точность равна 12.
en: Precision is equal to 12.

source: Точность — для полей целого и вещественного типов задает допустимый интервал от указанных в таблицах замен значений, при котором исходное значение будет заменено.
en: Precision: enables to set the allowable interval based on the values specified in the replacement tables for the integer and real fields. In this case, the source value will be replaced.

source: Трактовать NOCASE как UNICODE — флаг переопределяет сравнение NOCASE как UNICODE — языконезависимое сравнение символов Unicode без чувствительности к регистру.
en: Regard NOCASE as UNICODE: the checkbox redefines collation of NOCASE as UNICODE — the language independent Unicode character collation without case sensitivity.

source: Транспонировать Транспонировать — переворот таблицы, при котором наименования полей отображаются в столбцах, а статистические показатели — в строках;
en: Transpose Transpose: turn of the table when the fields names are displayed in columns, and the statistical indicators are displayed in rows.

source: Транспонируемые Транспонируемые — на основе этих полей будут сформированы 4 новых столбца: Имена, Метки, Значения, Типы данных.
en: On the basis of Transposed Transposed fields 4 new columns will be generated: Names, Captions, Values, Data types.

source: Трансформация
en: Transformation

source: Удаление файла (DELETE).
en: Delete (DELETE).

source: Удаленное — подключение с использованием сервера Firebird:
en: Remote: connection with the use of the Firebird server.

source: Удалить ветвь — удалить ветвь;
en: Delete branch enables to delete branch.

source: Удалить все ветви — удалить все ветви условий.
en: Delete all branches enables to delete all condition branches.

source: Удалить все выражения Удалить все выражения… — удаляет все имеющиеся выражения.
en: Delete all expressions Delete all expressions… enables to delete all existing expressions.

source: Удалить все порты — удалить все порты.
en: Delete all ports enables to delete all ports.

source: Удалить все Удалить все — перемещает все параметры обратно в список Доступные элементы;
en: Delete all Delete all enables to move all parameters back to the Available items list.

source: Удалить все — перемещает все элементы в список Доступные поля.
en: Delete all enables to move all items to the Available fields list.

source: Удалить выбранные Удалить выбранные — перемещает выделенные поля обратно в список Доступные поля.
en: Delete selected Delete selected enables to move the selected fields back to the Available fields list.

source: Удалить выражение Удалить выражение — удаляет текущее выражение;
en: Delete expression Delete expression enables to delete the current expression.

source: Удалить записи по ключевым полям и дополнить таблицу данными — алгоритм такой же, как и для предыдущего параметра, но после его выполнения строки из таблицы-источника будут добавлены к таблице базы данных.
en: Delete records by key fields and insert data into table provides the same algorithm as for the previous parameter but rows from the source table will be appended to the database table upon its execution.

source: Удалить записи по ключевым полям — дает возможность на следующем этапе Настройка соответствия между столбцами выбрать ключевое поле, по которому будет происходить удаление записей из таблицы базы данных.
en: Delete records by key fields enables to select a key field by which records will be deleted from the database table at the next stage - Map Source Columns to Table Fields .

source: Удалить порт — удалить порт.
en: Delete port enables to delete port.

source: Удалить Удалить — перемещает соотвествующий параметр обратно в список Доступные элементы;
en: Delete Delete enables to move the required parameter back to the Available items list.

source: Удалить Удалить — перемещает соответствующий параметр обратно в список Доступные элементы.
en: Delete Delete enables to move the required parameter back to the Available items list.

source: Удалить Удалить — удалить выделенную папку;
en: Delete Delete enables to delete the selected folder.

source: Удалить Удалить — удалить пользователя из системы;
en: Delete Delete: delete user from the system.

source: Удалить — перемещает текущий элемент в список Доступные поля;
en: Delete enables to move the current item to the Available fields list.

source: Удалять все неполные записи — удаляет записи добавленные узлом и записи с пустыми значениями в добавленных полях.
en: Delete all incomplete records enables to delete the records added by the node and the records with null values in the added fields.

source: Удалять добавленные неполные записи — удаляет записи добавленные узлом, не трогая записи из изначального набора;
en: Delete added incomplete records enables to delete the records added by the node not involving the records from the source data set.

source: Узел сценария с двумя входными и одним выходным портом.
en: Workflow node with two input ports and one output port.

source: Узел-ссылка
en: Reference node

source: Узел-ссылка Узел-ссылка
en: Reference Node Reference Node

source: Узел сценария выполняет отдельную операцию над данными.
en: The workflow node performs a separate operation with data.

source: Узлы подмодели «ABC-анализ».
en: "ABC Analysis" Supernode Nodes

source: Уникальные значения Уникальные значения — подсчитывается количество уникальных значений;
en: Unique values Unique values: the count of unique values is calculated.

source: Управление файлами
en: File management

source: Управление ходом выполнения сценария
en: Workflow progress control

source: Управление
en: Control

source: Управляющие переменные
en: Control variables

source: Упреждающая запись (WAL).
en: Write-ahead log (WAL).

source: Условие завершения — отношение сравнения переменной со Значением.
en: Termination condition: relation of the variable comparability with the Value.

source: Условие
en: Antecedent

source: Условие Условие
en: Condition Condition

source: Условие — выбор метода сравнения.
en: Condition provides selection of the comparison method.

source: Условие — для Измерений и Атрибутов позволяет выбирать из выпадающего списка условие фильтрации;
en: Condition for Dimensions and Attributes enables to select the filtration condition from the drop-down list.

source: Условие — область конфигурации условий для конкретной ветви, отображается при выделении ветви в списке.
en: Condition: the area for configuration of conditions for particular branch. It is displayed when selecting the listed branch.

source: Условие — управляющая конструкция, обеспечивающая ветвление алгоритма в зависимости от значения некоторого выражения (аналог "SWITCH...
en: Condition is the control structure that provides the algorithm branching according to the value of some expression (analogue of "SWITCH...

source: Условия фильтрации
en: Filter relation

source: Установка коэффициента L1-регуляризации — настройка данного параметра возможна только для алгоритмов LASSO, Elastic-Net;
en: L1-regularization coefficient setup: configuration of this parameter is possible only for LASSO, Elastic-Net algorithms.

source: Установка коэффициента L1-регуляции — настройка данного параметра возможна только для алгоритмов LASSO, Elastic-Net;
en: L1-regularization coefficient setup: configuration of this parameter is possible only for LASSO, Elastic-Net algorithms.

source: Установка коэффициента L2-регуляризации — настройка данного параметра возможна только для алгоритмов Ridge, Elastic-Net.
en: L2-regularization coefficient setup: configuration of this parameter is possible only for Ridge, Elastic-Net algorithms.

source: Установка коэффициента L2-регуляции — настройка данного параметра возможна только для алгоритмов Ridge, Elastic-Net.
en: L2-regularization coefficient setup: configuration of this parameter is possible only for Ridge, Elastic-Net algorithms.

source: Учитывать временную зону — выполнять конвертацию из локального времени в UTC и обратно для столбцов типа DateTime.
en: Use local time zone provides conversion from the local time to UTC and vice versa for the columns of the DateTime type.

source: Файлы;
en: Files

source: Факт Факт.
en: Fact Fact.

source: Факты Факты.
en: Measures Measures.

source: Факты — это данные, количественно описывающие бизнес-процесс, непрерывные по своему характеру, то есть они могут принимать бесконечное множество значений.
en: Measures mean the data describing the business process in the quantitative terms. They are continuous in concept, namely, they can take infinite set of values.

source: Фиксированное количество групп — исходный набор данных будет разделен на заданное количество групп.
en: Fixed group count: the source data set will be divided to the given count of groups.

source: Фиксированной ширины — поля в исходном файле имеют заданную ширину.
en: Fixed width: fields in the source file have the set width.

source: Фиксированный размер групп — исходный набор данных будет последовательно разделен на группы, размер которых определяется параметром "количество строк в группе".
en: Fixed group size: the source data set will be successively divided to the groups the size of which is controlled according to the "Row count in the group" parameter.

source: Фильтр строк
en: Row filter

source: Фильтр строк Фильтр строк
en: Row Filter Row Filter

source: Фильтрация
en: Filtration

source: Фильтрация Фильтрация — показать/скрыть Панель фильтрации.
en: Filtration Filtration: show/hide Filtration panel.

source: ФильтрацияФильтрация – позволяет отобрать поля по имени или его части.
en: FilterFilter enables to select fields by name or its part.

source: Фильтровать факты
en: Filter measures

source: Фильтровать факты Фильтровать факты
en: Filter Measures Filter Measures

source: Финальная модель — модель, которую алгоритм посчитал наилучшей, и дальнейшие действия не приведут к улучшению модели.
en: Final model: the model that has been considered by the algorithm as the best one, and the further actions will not bring about the model improvement.

source: Финансовые функции
en: Financial functions

source: Фирменные источники данных
en: Branded data sources

source: Форма Форма — данные будут представлены просмотром отдельной строки, начиная с первой по списку;
en: Form Form: the data will be displayed by view of a separate row starting from the first one in the list;

source: Форма Форма;
en: Form Form;

source: Формат времени — формат представления времени:
en: Time format: the format of the time representation:

source: Формат данных — выбор одного из вариантов:
en: Data format enables to select one of the following options:

source: Формат даты – параметром задается формат даты, используемый в импортируемом тексте.
en: Date format: the parameter enables to set the date format used in the imported text.

source: Формат даты — формат представления даты:
en: Date format: the format of the date representation:

source: Формат округления — указывается используемый для округления формат.
en: Rounding format: the format used for rounding is specified.

source: Формат Формат — открыть окно для настройки формата отображения данных.
en: Format Format: open format configuration window of data view.

source: Форматирование
en: Formatting

source: Форматирование Форматирование
en: Formatting Formatting

source: Формирование связи.
en: Establish Connection

source: Функции Калькулятора
en: Calculator functions

source: Функции агрегации данных
en: Functions of data aggregation

source: Функции агрегации - статистические функции, которые работают с множеством значений.
en: Aggregation functions are statistical functions that are used with a set of values.

source: Функции калькулятора
en: Calculator functions

source: Функции
en: Functions

source: Хи-квадрат
en: Chi-square

source: Хранение в памяти (MEMORY).
en: Memory (MEMORY).

source: Хранилище сертификатов — выпадающий список, который становится доступен при выборе Предоставить сертификат клиента.
en: Certificate store: the drop-down list that will be available when selecting Provide client certificate.

source: Хранилище сертификатов — это выпадающий список, который становится доступен при выборе Предоставить сертификат клиента.
en: Certificate store: the drop-down list that will be available when selecting Provide client certificate.

source: Хранилище файлов — выводит информацию о способе подключения к файлу-источнику.
en: File storage enables to display information on method of connection to the source file.

source: Хранилище файлов — выводит информацию о способе подключения к файлу-источнику;
en: File storage enables to display information on method of connection to the source file.

source: Хранилище файлов — выводит информацию о способе подключения к файлу-приемнику.
en: File storage enables to display information on method of connection to the destination file.

source: Цвет фона — по умолчанию установлен белый (FFFFFFFF), однако цвет можно изменить, используя для этого.
en: Background color: the white color (FFFFFFFF) is set by default. However, it is possible to change the color using the following tools for this purpose.

source: Цветовая схема.
en: Color scheme.

source: Целиком — искомый фрагмент полностью повторяет значение.
en: Full: the searched fragment fully repeats the value.

source: Целый Число степеней свободы
en: Integer Number of degrees of freedom

source: ЦелыйЧисло степеней свободы
en: IntegerNumber of degrees of freedom

source: Центр кластера — среднее значение переменных объектов, входящих в кластер.
en: Cluster center: the average value of the objects variables included into cluster.

source: Центр кластеров Центр кластеров.
en: Cluster center Cluster center.

source: Цикл с постусловием — количество итераций такого цикла регулируется условием, на соответствие которому при каждой итерации проверяется переменная.
en: Postcondition loop: the iteration count of such loop is controlled according to the condition for consistency with which a variable is checked for each iteration.

source: Цикл
en: Loop

source: Цикл Цикл
en: Loop Loop

source: Цикл — управляющая конструкция, предназначенная для организации многократного исполнения набора инструкций.
en: Loop is the control structure that is designated for organization of the multiple execution of the instructions set.

source: ЧАКФ — коэффициенты частной автокорреляционной функции.
en: PACF: partial autocorrelation function coefficients.

source: Часы.
en: Hours.

source: Чекбокс — в этих столбцах у Подключаемых таблиц флажком отмечаются поля участвующие в сопоставлении.
en: Checkbox: the fields involved into mapping are selected with a checkbox in these columns of Connected tables.

source: Чекбокс — поле указывает наличие прав у пользователя на использование папки.
en: Checkbox: it is displayed in the field whether a user has rights to use a folder.

source: Число десятичных знаков — количество отображаемых знаков после запятой.
en: Decimal place limit: the number of displayed decimal places.

source: Число степеней свободы модели
en: Number of the model degrees of freedom

source: Число Число;
en: Number Number.
